CheatSheet.org
* Hello World
  :PROPERTIES:
  :CUSTOM_ID: Hello-World
  :END:

# AngularJS is a JavaScript framework that operates on the client side and is used
# to develop web applications.  Web development is one of the most preferred and
# cost-effective ways to create distributed applications.  The deployment done
# once on one machine can be made accessible to all the users on the world wide
# web.

  AngularJS enhances HTML by giving it a /dynamic/ layer; i.e., raw HTML just
  displays things, but with AngularJS we can have parts shown according to, say,
  input boxes and variables (which raw HTML does not have).
  [See the [[https://alhassy.github.io/JavaScriptCheatSheet/CheatSheet.pdf][JavaScriptCheatSheet]] PDF.]

  # jQuery is a more verbose alternative.

  /An example is worth a thousand words!/
  Here's one from the [[https://angularjs.org/][docs]]:
  #+begin_src html :tangle learning/index.html
<!doctype html>
<html ng-app> <!-- ⟨0⟩ AngularJS is active for the entire tree -->
  <head>
    <!-- ⟨1⟩ Actually load AngularJS -->
    <script
src="https://ajax.googleapis.com/ajax/libs/angularjs/1.8.2/angular.min.js">
    </script>
  </head>
  <body>
    <div>
      <label>Name:</label>
      <!-- ⟨2⟩ The *value* of this text box is named “yourName” -->
      <input type="text"
             ng-model="yourName"
             placeholder="Enter a name here">
      <hr>
      <!-- ⟨3⟩ Actually use the “yourName” value here,
           ,*whenever* it is updated! -->
      <h1>Hello {{yourName.toUpperCase()}}!</h1>
    </div>
  </body>
</html>
  #+end_src

This is a /self-contained/ *interactive* program: Whenever the input box's value is
changed then so is the greeting header “hello ...!”.

Bindings like ~{{this}}~ are known as /[[https://github.com/janl/mustache.js#templates][mustache]] tags, which tell AngularJS that it
should evaluate an [[https://docs.angularjs.org/guide/expression][expression]]/ and insert the result into the DOM in place of
the binding. Rather than a one-time insert, a binding will result in efficient
continuous updates whenever the result of the expression evaluation changes.

/Exercise!/ Using ~<input type="number" ...>~, make a super simple site with two
input boxes for numbers and a header that shows their sum whenever a user inputs
values.  [[https://www.guru99.com/angularjs-directive.html#4][(Solution)]]
# Notice that input boxes for numbers have /step/ arrows.
:Solution:
  #+begin_src html :tangle learning/sum.html
<!doctype html>
<html ng-app> <!-- ⟨0⟩ AngularJS is active for the entire tree -->
  <head>
    <!-- ⟨1⟩ Actually load AngularJS -->
    <script src="https://ajax.googleapis.com/ajax/libs/angularjs/1.8.2/angular.min.js"></script>
  </head>
  <body>
    <div>
      <label>First:</label>
      <!-- ⟨2⟩ The *value* of this text box is named “yourName” -->
      <input type="number" ng-model="first" placeholder="Enter a number here">
      <label>Second:</label>
      <!-- ⟨2⟩ The *value* of this text box is named “yourName” -->
      <input type="number" ng-model="second" placeholder="Enter a number here">
      <hr>
      <!-- ⟨3⟩ Actually use the “yourName” value here, *whenever* it is updated! -->
      <h1>sum =  {{first + second}}</h1>
    </div>
  </body>
</html>
  #+end_src
:End:

/Exercise!/ Get a twitter handle from the user and show a link to that twitter
page.
# 𝒳  ↦  twitter.com/𝒳.

# /*Going forward,*/ we will omit lines 1-7 and lines 16-17.
# They are required, but we do not want to waste space repeating them.

/Warning!/ “AngularJS” (controllers and ~$scope~) has been completely rewritten as
[[https://angular-templates.io/tutorials/about/learn-angular-from-scratch-step-by-step#building-an-angular-crud-example-project-step-by-step][“Angular”]] (components focused) in an effort to simplify it.

#+latex: \columnbreak

