index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-28 Sun 07:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>AngularJS CheatSheet</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="[[https://alhassy.github.io/][Musa Al-hassy]]" />
        <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/tooltipster.bundle.min.css"/>

        <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/plugins/tooltipster/sideTip/themes/tooltipster-sideTip-punk.min.css" />




</head>
<body>
<div id="content">
<h1 class="title">AngularJS CheatSheet</h1>
<p>
<div class="header">
  <a href="https://alhassy.github.io/" class="logo">Life & Computing Science</a>
  <br>
    <a href="https://alhassy.github.io/AlBasmala">AlBasmala</a>
    <a href="https://alhassy.github.io/archive">Archive</a>
    <a href="https://alhassy.github.io/tags">Tags</a>
    <a href="https://alhassy.github.io/rss.xml">RSS</a>
    <a href="https://alhassy.github.io/about">About</a>
</div><style>  summary:hover {background:pink;} </style>
        <style>
        /* From: https://endlessparentheses.com/public/css/endless.css */
        /* See also: https://meta.superuser.com/questions/4788/css-for-the-new-kbd-style */
        kbd
        {
          -moz-border-radius: 6px;
          -moz-box-shadow: 0 1px 0 rgba(0,0,0,0.2),0 0 0 2px #fff inset;
          -webkit-border-radius: 6px;
          -webkit-box-shadow: 0 1px 0 rgba(0,0,0,0.2),0 0 0 2px #fff inset;
          background-color: #f7f7f7;
          border: 1px solid #ccc;
          border-radius: 6px;
          box-shadow: 0 1px 0 rgba(0,0,0,0.2),0 0 0 2px #fff inset;
          color: #333;
          display: inline-block;
          font-family: 'Droid Sans Mono', monospace;
          font-size: 80%;
          font-weight: normal;
          line-height: inherit;
          margin: 0 .1em;
          padding: .08em .4em;
          text-shadow: 0 1px 0 #fff;
          word-spacing: -4px;

          box-shadow: 2px 2px 2px #222; /* MA: An extra I've added. */
        }
        </style>
        <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/tooltipster.bundle.min.css"/>

        <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/plugins/tooltipster/sideTip/themes/tooltipster-sideTip-punk.min.css" />

        <script type="text/javascript">
            if (typeof jQuery == 'undefined') {
                document.write(unescape('%3Cscript src="https://code.jquery.com/jquery-1.10.0.min.js"%3E%3C/script%3E'));
            }
        </script>

         <script type="text/javascript"            src="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/js/tooltipster.bundle.min.js"></script>

          <script>
                 $(document).ready(function() {
                     $('.tooltip').tooltipster({
                         theme: 'tooltipster-punk',
                         contentAsHTML: true,
                         animation: 'grow',
                         delay: [100,500],
                         // trigger: 'click'
                         trigger: 'custom',
                         triggerOpen: {
                             mouseenter: true
                         },
                         triggerClose: {
                             originClick: true,
                             scroll: true
                         }
         });
                 });
             </script>

        <style>
           abbr {color: red;}

           .tooltip { border-bottom: 1px dotted #000;
                      color:red;
                      text-decoration: none;}
        </style>
        <meta name="author" content="Musa Al-hassy">
    <meta name="referrer" content="no-referrer"><link href="usual-org-front-matter.css" rel="stylesheet" type="text/css" /><link href="org-notes-style.css" rel="stylesheet" type="text/css" /><link href="floating-toc.css" rel="stylesheet" type="text/css" /><link href="blog-banner.css" rel="stylesheet" type="text/css" /><link rel="icon" href="images/favicon.png"><script type="text/javascript">
   /*
   @licstart  The following is the entire license notice for the
   JavaScript code in this tag.

   Copyright (C) 2012-2020 Free Software Foundation, Inc.

   The JavaScript code in this tag is free software: you can
   redistribute it and/or modify it under the terms of the GNU
   General Public License (GNU GPL) as published by the Free Software
   Foundation, either version 3 of the License, or (at your option)
   any later version.  The code is distributed WITHOUT ANY WARRANTY;
   without even the implied warranty of MERCHANTABILITY or FITNESS
   FOR A PARTICULAR PURPOSE.  See the GNU GPL for more details.

   As additional permission under GNU GPL version 3 section 7, you
   may distribute non-source (e.g., minimized or compacted) forms of
   that code without the copy of the GNU GPL normally required by
   section 4, provided you include this license notice and a URL
   through which recipients can access the Corresponding Source.


   @licend  The above is the entire license notice
   for the JavaScript code in this tag.
   */
   <!--/*--><![CDATA[/*><!--*/
    function CodeHighlightOn(elem, id)
    {
      var target = document.getElementById(id);
      if(null != target) {
        elem.cacheClassElem = elem.className;
        elem.cacheClassTarget = target.className;
        target.className = "code-highlighted";
        elem.className   = "code-highlighted";
      }
    }
    function CodeHighlightOff(elem, id)
    {
      var target = document.getElementById(id);
      if(elem.cacheClassElem)
        elem.className = elem.cacheClassElem;
      if(elem.cacheClassTarget)
        target.className = elem.cacheClassTarget;
    }
   /*]]>*///-->
   </script><link href="https://alhassy.github.io/org-notes-style.css" rel="stylesheet" type="text/css" /><link href="https://alhassy.github.io/floating-toc.css" rel="stylesheet" type="text/css" /><link href="https://alhassy.github.io/blog-banner.css" rel="stylesheet" type="text/css" /><br><center><h1>AngularJS CheatSheet</h1></center>
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#Hello-World">1. Hello World</a></li>
<li><a href="#AngularJS-makes-HTML-into-a-language-with-variables-and-looping">2. AngularJS makes HTML into a language with variables and control flow</a></li>
<li><a href="#Filters">3. Filters</a></li>
<li><a href="#Apps">4. Apps</a></li>
<li><a href="#Directives">5. Directives &#x2014;Essentially “HTML Functions”</a></li>
<li><a href="#MVC">6. The MVC Design Pattern &#x2014;Model, View, Controller</a>
<ul>
<li><a href="#How-do-we-split-up-an-app">6.1. <i>How do we split up an app?</i></a></li>
<li><a href="#Number-Guessing-Game">6.2. Number Guessing Game</a></li>
</ul>
</li>
<li><a href="#Single-Page-Applications-SPA-and-src-emacs-lisp-exports-code-route">7. Single Page Applications (SPA) and <code class="src src-emacs-lisp">$route</code></a></li>
<li><a href="#Reads">8. Reads</a></li>
</ul>
</div>
</div>















<div id="outline-container-Hello-World" class="outline-2">
<h2 id="Hello-World"><span class="section-number-2">1</span> Hello World</h2>
<div class="outline-text-2" id="text-Hello-World">
<p>
AngularJS enhances HTML by giving it a <i>dynamic</i> layer; i.e., raw HTML just
displays things, but with AngularJS we can have parts shown according to, say,
input boxes and variables (which raw HTML does not have).
[See the <a href="https://alhassy.github.io/JavaScriptCheatSheet/CheatSheet.pdf">JavaScriptCheatSheet</a> PDF.]
</p>

<p>
<i>An example is worth a thousand words!</i>
Here's one from the <a href="https://angularjs.org/">docs</a>:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #3a81c3; font-weight: bold;">!doctype</span> html&gt;
&lt;<span style="color: #6c3163; font-weight: bold;">html</span> ng-app&gt; <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#10216;0&#10217; AngularJS is active for the entire tree </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
  &lt;<span style="color: #6c3163; font-weight: bold;">head</span>&gt;
    <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#10216;1&#10217; Actually load AngularJS </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
    &lt;<span style="color: #6c3163; font-weight: bold;">script</span>
<span style="color: #715ab1;">src</span>=<span style="color: #2d9574;">"https://ajax.googleapis.com/ajax/libs/angularjs/1.8.2/angular.min.js"</span>&gt;
    &lt;/<span style="color: #6c3163; font-weight: bold;">script</span>&gt;
  &lt;/<span style="color: #6c3163; font-weight: bold;">head</span>&gt;
  &lt;<span style="color: #6c3163; font-weight: bold;">body</span>&gt;
    &lt;<span style="color: #6c3163; font-weight: bold;">div</span>&gt;
      &lt;<span style="color: #6c3163; font-weight: bold;">label</span>&gt;Name:&lt;/<span style="color: #6c3163; font-weight: bold;">label</span>&gt;
      <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#10216;2&#10217; The *value* of this text box </span><span style="color: #2aa1ae; background-color: #ecf3ec; text-decoration: underline;">is named</span><span style="color: #2aa1ae; background-color: #ecf3ec;"> &#8220;yourName&#8221; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      &lt;<span style="color: #6c3163; font-weight: bold;">input</span> <span style="color: #715ab1;">type</span>=<span style="color: #2d9574;">"text"</span>
             <span style="color: #715ab1;">ng-model</span>=<span style="color: #2d9574;">"yourName"</span>
             <span style="color: #715ab1;">placeholder</span>=<span style="color: #2d9574;">"Enter a name here"</span>&gt;
      &lt;<span style="color: #6c3163; font-weight: bold;">hr</span>&gt;
      <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#10216;3&#10217; Actually use the &#8220;yourName&#8221; value here,</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">           *whenever* it </span><span style="color: #2aa1ae; background-color: #ecf3ec; text-decoration: underline;">is updated</span><span style="color: #2aa1ae; background-color: #ecf3ec;">! </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      &lt;<span style="color: #6c3163; font-weight: bold;">h1</span>&gt;<span style="font-weight: bold; text-decoration: underline;">Hello {{yourName.toUpperCase()}}!</span>&lt;/<span style="color: #6c3163; font-weight: bold;">h1</span>&gt;
    &lt;/<span style="color: #6c3163; font-weight: bold;">div</span>&gt;
  &lt;/<span style="color: #6c3163; font-weight: bold;">body</span>&gt;
&lt;/<span style="color: #6c3163; font-weight: bold;">html</span>&gt;
</pre>
</div>

<p>
This is a <i>self-contained</i> <b>interactive</b> program: Whenever the input box's value is
changed then so is the greeting header “hello &#x2026;!”.
</p>

<p>
Bindings like <code>{{this}}</code> are known as <i><a href="https://github.com/janl/mustache.js#templates">mustache</a> tags, which tell AngularJS that it
should evaluate an <a href="https://docs.angularjs.org/guide/expression">expression</a></i> and insert the result into the DOM in place of
the binding. Rather than a one-time insert, a binding will result in efficient
continuous updates whenever the result of the expression evaluation changes.
</p>

<p>
<i>Exercise!</i> Using <code>&lt;input type="number" ...&gt;</code>, make a super simple site with two
input boxes for numbers and a header that shows their sum whenever a user inputs
values.  <a href="https://www.guru99.com/angularjs-directive.html#4">(Solution)</a>
</p>

<p>
<i>Exercise!</i> Get a twitter handle from the user and show a link to that twitter
page.
</p>

<p>
<i>Warning!</i> “AngularJS” (controllers and <code>$scope</code>) has been completely rewritten as
<a href="https://angular-templates.io/tutorials/about/learn-angular-from-scratch-step-by-step#building-an-angular-crud-example-project-step-by-step">“Angular”</a> (components focused) in an effort to simplify it.
</p>
</div>
</div>
