CheatSheet.org
* [[https://www.guru99.com/angularjs-expressions.html][AngularJS makes HTML into a language with variables and control flow]]
  :PROPERTIES:
  :CUSTOM_ID: AngularJS-makes-HTML-into-a-language-with-variables-and-looping
  :END:

# In essence, AngularJS is a language itself.
# It /extends/ HTML while continuing to support JS.

AngularJS enhances HTML with variables, filters (explained below), arrays, JSON
Objects, and looping & conditional control flow ---using JS's usual ~&&, ||, ==,~
etc for Booleans.  Later we'll see that functions can be defined in an
associated /controller,/ then used in the /view/.
# As with HTML+JS, functions can be defined
# within src_html[:exports code]{<script>} tags.

# +latex: {\color{white} hello}

#+latex: \vspace{-2em}
#+begin_src html :tangle learning/vars.html
<html ng-app>
  <head>
    <script
src="https://ajax.googleapis.com/ajax/libs/angularjs/1.8.2/angular.min.js">
    </script>
  </head>
  <body>
    <!-- VARIABLES ------------------------------------------------------->
    <div ng-init="firstname = 'Jason'; lastname = 'Jasim'">
      {{ firstname + ' ' + lastname }} <br> <!-- Jason Jasim -->
      <!-- Let's declare a var, but hide the resulting value from view-->
      <p hidden>  {{  middlename = 'J.'  }}  </p>
      <!-- Show the full name: Jason J. Jasim -->
      {{ firstname + ' ' + middlename + ' ' + lastname }} <br>

      <!-- APPLICATION: Keeping count ------------------------------------>
      <button ng-init='count = 0' ng-click='count = count + 1'>
        Increment
      </button>
      <p> Count: {{count}} </p>

      <!-- FILTERS ------------------------------------------------------->
      {{ firstname + ' ' + lastname  |  uppercase }}<br> <!--JASON JASIM-->
      Price : {{ 21 | currency }} <br> <!-- Price : $21.00 -->
      Pi: {{3.14159265358979323846 | number:2 }} <br> <!-- Pi: 3.14 -->

      <!-- ARRAYS -------------------------------------------------------->
      <!-- ["hi","indeed"] -->
      {{ ["hello", "hi", "indeed", "bye"] | filter: 'i' }} <br>
      <!-- Sort alphabetically -->
      {{ ["hello", "hi", "indeed", "bye"] | orderBy: '' }} <br>

      <!-- JSON OBJECTS -------------------------------------------------->
      <!-- Lets make an array of objects ... -->
      {{ people = [ {name: 'kathy', age: 32},
                    {name: 'bob', age: 12},
                    {name: 'jasim', age: 114}
                  ] }}
      <!-- ... and sort according to a field. -->
      {{ people | orderBy: 'age' }}

      <!-- APPLICATION: Search box --------------------------------------->
      <br> Search: <input ng-model="query" />
      <br> Results: {{ people | filter: query }}

      <!-- LOOPING ------------------------------------------------------->
      <!-- No more hardcoded lists! -->
      <!-- ng-repeat creates a <li> element for each element in the list,
           using the <li> tag as the template. -->
      <ul>
        <li ng-repeat="p in people | orderBy:'age'">
          {{p.name + ' is ' + p.age + ' years old!' | uppercase }}
        </li>
      </ul>

      <!-- CONDITIONALS -------------------------------------------------->
      <!-- Name this inputs box's value ‘age’ -->
      <input type="number" ng-model="age">
      <!-- “Hello” is shown whenever the above ‘age’ input is truthy. -->
      <p type="text" ng-if="age"> Hello! <p>
      <!-- This input box shows only if the above, ‘age’, has value 12. -->
      <input type="text" ng-if="age == 12" placeholder="Your name?">

    </div>
  </body>
</html>
#+end_src

# file:///Users/weever/Desktop/learning/vars.html


src_html[:exports code]{<!-- VARIABLES -->} To run some code when an element is
clicked, we use src_emacs-lisp[:exports code]{ng-click}.  In our case, we have a
variable whose value increases with each user click.

src_html[:exports code]{<!-- LOOPING -->}
We are using the HTML tags of src_emacs-lisp[:exports code]{<ul>} (Unordered
List) and src_emacs-lisp[:exports code]{<li>} (List Item) to display the list of
items in our array.

src_html[:exports code]{<!-- CONDITIONALS -->}
When the condition to src_emacs-lisp[:exports code]{ng-if} is falsy, the HTML
element is removed from the DOM; otherwise it's added to the DOM.

Note that arbitrary JS expressions will not be evaluated in moustaches; for
that, we give the div in a ‘controller’ (below) which attaches a method to the
src_emacs-lisp[:exports code]{$scope}, and in that method we do our arbitrary JS
and that method is the one we /can/ call in moustaches (within our div).  See [[https://docs.angularjs.org/guide/expression#:~:text=AngularJS%20expressions%20are%20JavaScript%2Dlike,1%2B2][here]]
for the docs on the permissible expressions.

Moreover, AngularJS provides HTML directives that “already exist” but /know how
evaluate {{moustache}} expressions/; e.g., src_C[:exports code]{<a
href="#!/go/{{expr}}">Go!</a>} would /not/ evaluate src_emacs-lisp[:exports
code]{expr}, for that we use src_emacs-lisp[:exports code]{ng-href}.

#+latex: \vspace{1em}
#+begin_center
/Bindings can come from intricate JS code!/ See “MVC” below.
#+end_center
#+latex: \vspace{-0.5em}

