index.html

<div id="outline-container-AngularJS-makes-HTML-into-a-language-with-variables-and-looping" class="outline-2">
<h2 id="AngularJS-makes-HTML-into-a-language-with-variables-and-looping"><span class="section-number-2">2</span> <a href="https://www.guru99.com/angularjs-expressions.html">AngularJS makes HTML into a language with variables and control flow</a></h2>
<div class="outline-text-2" id="text-AngularJS-makes-HTML-into-a-language-with-variables-and-looping">
<p>
AngularJS enhances HTML with variables, filters (explained below), arrays, JSON
Objects, and looping &amp; conditional control flow &#x2014;using JS's usual <code>&amp;&amp;, ||, ==,</code>
etc for Booleans.  Later we'll see that functions can be defined in an
associated <i>controller,</i> then used in the <i>view</i>.
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #6c3163; font-weight: bold;">html</span> ng-app&gt;
  &lt;<span style="color: #6c3163; font-weight: bold;">head</span>&gt;
    &lt;<span style="color: #6c3163; font-weight: bold;">script</span>
<span style="color: #715ab1;">src</span>=<span style="color: #2d9574;">"https://ajax.googleapis.com/ajax/libs/angularjs/1.8.2/angular.min.js"</span>&gt;
    &lt;/<span style="color: #6c3163; font-weight: bold;">script</span>&gt;
  &lt;/<span style="color: #6c3163; font-weight: bold;">head</span>&gt;
  &lt;<span style="color: #6c3163; font-weight: bold;">body</span>&gt;
    <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">VARIABLES -----------------------------------------------------</span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
    &lt;<span style="color: #6c3163; font-weight: bold;">div</span> <span style="color: #715ab1;">ng-init</span>=<span style="color: #2d9574;">"firstname = 'Jason'; lastname = 'Jasim'"</span>&gt;
      {{ firstname + ' ' + lastname }} &lt;<span style="color: #6c3163; font-weight: bold;">br</span>&gt; <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Jason Jasim </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Let's declare a var, but hide the resulting value from view</span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      &lt;<span style="color: #6c3163; font-weight: bold;">p</span> hidden&gt;  {{  middlename = 'J.'  }}  &lt;/<span style="color: #6c3163; font-weight: bold;">p</span>&gt;
      <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Show the full name: Jason J. Jasim </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      {{ firstname + ' ' + middlename + ' ' + lastname }} &lt;<span style="color: #6c3163; font-weight: bold;">br</span>&gt;

      <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">APPLICATION: Keeping count ----------------------------------</span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      &lt;<span style="color: #6c3163; font-weight: bold;">button</span> <span style="color: #715ab1;">ng-init</span>=<span style="color: #2d9574;">'count = 0'</span> <span style="color: #715ab1;">ng-click</span>=<span style="color: #2d9574;">'count = count + 1'</span>&gt;
        Increment
      &lt;/<span style="color: #6c3163; font-weight: bold;">button</span>&gt;
      &lt;<span style="color: #6c3163; font-weight: bold;">p</span>&gt; Count: {{count}} &lt;/<span style="color: #6c3163; font-weight: bold;">p</span>&gt;

      <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">FILTERS -----------------------------------------------------</span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      {{ firstname + ' ' + lastname  |  uppercase }}&lt;<span style="color: #6c3163; font-weight: bold;">br</span>&gt; <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!--</span><span style="color: #2aa1ae; background-color: #ecf3ec;">JASON JASIM</span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      Price : {{ 21 | currency }} &lt;<span style="color: #6c3163; font-weight: bold;">br</span>&gt; <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Price : $21.00 </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      Pi: {{3.14159265358979323846 | number:2 }} &lt;<span style="color: #6c3163; font-weight: bold;">br</span>&gt; <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Pi: 3.14 </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>

      <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">ARRAYS ------------------------------------------------------</span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">["hi","indeed"] </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      {{ ["hello", "hi", "indeed", "bye"] | filter: 'i' }} &lt;<span style="color: #6c3163; font-weight: bold;">br</span>&gt;
      <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Sort alphabetically </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      {{ ["hello", "hi", "indeed", "bye"] | orderBy: '' }} &lt;<span style="color: #6c3163; font-weight: bold;">br</span>&gt;

      <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">JSON OBJECTS ------------------------------------------------</span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Lets make an array of objects ... </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      {{ people = [ {name: 'kathy', age: 32},
                    {name: 'bob', age: 12},
                    {name: 'jasim', age: 114}
                  ] }}
      <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">... and sort according to a field. </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      {{ people | orderBy: 'age' }}

      <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">APPLICATION: Search box -------------------------------------</span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      &lt;<span style="color: #6c3163; font-weight: bold;">br</span>&gt; Search: &lt;<span style="color: #6c3163; font-weight: bold;">input</span> <span style="color: #715ab1;">ng-model</span>=<span style="color: #2d9574;">"query"</span> /&gt;
      &lt;<span style="color: #6c3163; font-weight: bold;">br</span>&gt; Results: {{ people | filter: query }}

      <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">LOOPING -----------------------------------------------------</span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">No more hardcoded lists! </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">ng-repeat creates a &lt;li&gt; element for each element in the list,</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">           using the &lt;li&gt; tag as the template. </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      &lt;<span style="color: #6c3163; font-weight: bold;">ul</span>&gt;
        &lt;<span style="color: #6c3163; font-weight: bold;">li</span> <span style="color: #715ab1;">ng-repeat</span>=<span style="color: #2d9574;">"p in people | orderBy:'age'"</span>&gt;
          {{p.name + ' is ' + p.age + ' years old!' | uppercase }}
        &lt;/<span style="color: #6c3163; font-weight: bold;">li</span>&gt;
      &lt;/<span style="color: #6c3163; font-weight: bold;">ul</span>&gt;

      <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">CONDITIONALS ------------------------------------------------</span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Name this inputs box's value &#8216;age&#8217; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      &lt;<span style="color: #6c3163; font-weight: bold;">input</span> <span style="color: #715ab1;">type</span>=<span style="color: #2d9574;">"number"</span> <span style="color: #715ab1;">ng-model</span>=<span style="color: #2d9574;">"age"</span>&gt;
      <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#8220;Hello&#8221; </span><span style="color: #2aa1ae; background-color: #ecf3ec; text-decoration: underline;">is shown</span><span style="color: #2aa1ae; background-color: #ecf3ec;"> whenever the above &#8216;age&#8217; input is truthy. </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      &lt;<span style="color: #6c3163; font-weight: bold;">p</span> <span style="color: #715ab1;">type</span>=<span style="color: #2d9574;">"text"</span> <span style="color: #715ab1;">ng-if</span>=<span style="color: #2d9574;">"age"</span>&gt; Hello! &lt;<span style="color: #6c3163; font-weight: bold;">p</span>&gt;
      <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">This input box shows only if the above, &#8216;age&#8217;, has value 12. </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
      &lt;<span style="color: #6c3163; font-weight: bold;">input</span> <span style="color: #715ab1;">type</span>=<span style="color: #2d9574;">"text"</span> <span style="color: #715ab1;">ng-if</span>=<span style="color: #2d9574;">"age == 12"</span> <span style="color: #715ab1;">placeholder</span>=<span style="color: #2d9574;">"Your name?"</span>&gt;

    &lt;/<span style="color: #6c3163; font-weight: bold;">div</span>&gt;
  &lt;/<span style="color: #6c3163; font-weight: bold;">body</span>&gt;
&lt;/<span style="color: #6c3163; font-weight: bold;">html</span>&gt;
</pre>
</div>


<p>
<code class="src src-html"><span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">VARIABLES </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span></code> To run some code when an element is
clicked, we use <code class="src src-emacs-lisp">ng-click</code>.  In our case, we have a
variable whose value increases with each user click.
</p>

<p>
<code class="src src-html"><span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">LOOPING </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span></code>
We are using the HTML tags of <code class="src src-emacs-lisp">&lt;ul&gt;</code> (Unordered
List) and <code class="src src-emacs-lisp">&lt;li&gt;</code> (List Item) to display the list of
items in our array.
</p>

<p>
<code class="src src-html"><span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">CONDITIONALS </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span></code>
When the condition to <code class="src src-emacs-lisp">ng-if</code> is falsy, the HTML
element is removed from the DOM; otherwise it's added to the DOM.
</p>

<p>
Note that arbitrary JS expressions will not be evaluated in moustaches; for
that, we give the div in a ‘controller’ (below) which attaches a method to the
<code class="src src-emacs-lisp">$scope</code>, and in that method we do our arbitrary JS
and that method is the one we <i>can</i> call in moustaches (within our div).  See <a href="https://docs.angularjs.org/guide/expression#:~:text=AngularJS%20expressions%20are%20JavaScript%2Dlike,1%2B2">here</a>
for the docs on the permissible expressions.
</p>

<p>
Moreover, AngularJS provides HTML directives that “already exist” but <i>know how
evaluate {{moustache}} expressions</i>; e.g., <code class="src src-C">&lt;a href=<span style="color: #2d9574;">"#!/go/{{expr}}"</span>&gt;Go<span style="color: #4e3163;">!</span>&lt;/a&gt;</code> would <i>not</i> evaluate <code class="src src-emacs-lisp">expr</code>, for that we use <code class="src src-emacs-lisp">ng-href</code>.
</p>

<div class="org-center">
<p>
<i>Bindings can come from intricate JS code!</i> See “MVC” below.
</p>
</div>
</div>
</div>
