CheatSheet.org
* [[https://www.guru99.com/angularjs-filter.html][Filters]]
  :PROPERTIES:
  :CUSTOM_ID: Filters
  :END:

# *Filters* are exclusive to AngularJS and are not present in the traditional JavaScript.

/Filters/ change a value's presentation; e.g., the src_emacs-lisp[:exports
code]{currency} filter displays a number with a “$” symbol and the right number
of decimal places, whereas the src_emacs-lisp[:exports code]{filter} filter
returns a subset of an array.  Other filters include src_emacs-lisp[:exports
code]{uppercase} and src_emacs-lisp[:exports code]{lowercase} for formatting
strings, and src_emacs-lisp[:exports code]{orderBy} to sort arrays,
src_emacs-lisp[:exports code]{json} to show a JS object literally ---useful for
debugging--- and src_emacs-lisp[:exports code]{limitTo} which slices an array;
e.g., src_html[:exports code]{arr | limitTo:2:0} gets the subarray of 2 elements
starting at index 0; finally, src_emacs-lisp[:exports code]{number:N} rounds a
number to $N$ decimal places.

As seen above, filters can be used in both {{expressions}} (using the pipe, ‘|’,
operator) and <directives>.  We can also define our own filters:
#+begin_src html :tangle learning/filters_custom.html
<html ng-app="myApp">
  <head>
    <script
src="https://ajax.googleapis.com/ajax/libs/angularjs/1.8.2/angular.min.js">
    </script>
  </head>
  <body>
    {{ "hello" | DemoFilter}} <!-- hello woah! -->
    <script> // NEW
      angular.module("myApp", [])
       .filter('DemoFilter', function() {
           return function(input) {
             // The actual custom filter code goes here
             return input + " woah!"
      }})
    </script>
  </body>
</html>
#+end_src
# file:~/Desktop/learning/filters_custom.html

* Apps
  :PROPERTIES:
  :CUSTOM_ID: Apps
  :END:

  We may have multiple AngularJS apps for the same HTML file, and each app is
  declared with the syntax src_emacs-lisp[:exports code]{var app =
  angular.module(appName,dependencies);}.  One then furnishes each
  src_emacs-lisp[:exports code]{app} with its own controllers, filters,
  directives, etc ---e.g., src_js[:exports code]{app.filter(..., ...)}  as shown
  above.

