index.html

<div id="outline-container-Filters" class="outline-2">
<h2 id="Filters"><span class="section-number-2">3</span> <a href="https://www.guru99.com/angularjs-filter.html">Filters</a></h2>
<div class="outline-text-2" id="text-Filters">
<p>
<i>Filters</i> change a value's presentation; e.g., the <code class="src src-emacs-lisp">currency</code> filter displays a number with a “$” symbol and the right number
of decimal places, whereas the <code class="src src-emacs-lisp">filter</code> filter
returns a subset of an array.  Other filters include <code class="src src-emacs-lisp">uppercase</code> and <code class="src src-emacs-lisp">lowercase</code> for formatting
strings, and <code class="src src-emacs-lisp">orderBy</code> to sort arrays,
<code class="src src-emacs-lisp">json</code> to show a JS object literally &#x2014;useful for
debugging&#x2014; and <code class="src src-emacs-lisp">limitTo</code> which slices an array;
e.g., <code class="src src-html">arr | limitTo:2:0</code> gets the subarray of 2 elements
starting at index 0; finally, <code class="src src-emacs-lisp">number:N</code> rounds a
number to \(N\) decimal places.
</p>

<p>
As seen above, filters can be used in both {{expressions}} (using the pipe, ‘|’,
operator) and &lt;directives&gt;.  We can also define our own filters:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #6c3163; font-weight: bold;">html</span> <span style="color: #715ab1;">ng-app</span>=<span style="color: #2d9574;">"myApp"</span>&gt;
  &lt;<span style="color: #6c3163; font-weight: bold;">head</span>&gt;
    &lt;<span style="color: #6c3163; font-weight: bold;">script</span>
<span style="color: #715ab1;">src</span>=<span style="color: #2d9574;">"https://ajax.googleapis.com/ajax/libs/angularjs/1.8.2/angular.min.js"</span>&gt;
    &lt;/<span style="color: #6c3163; font-weight: bold;">script</span>&gt;
  &lt;/<span style="color: #6c3163; font-weight: bold;">head</span>&gt;
  &lt;<span style="color: #6c3163; font-weight: bold;">body</span>&gt;
    {{ "hello" | DemoFilter}} <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">hello woah! </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
    &lt;<span style="color: #6c3163; font-weight: bold;">script</span>&gt; // NEW
      angular.module("myApp", [])
       .filter('DemoFilter', function() {
           return function(input) {
             // The actual custom filter code goes here
             return input + " woah!"
      }})
    &lt;/<span style="color: #6c3163; font-weight: bold;">script</span>&gt;
  &lt;/<span style="color: #6c3163; font-weight: bold;">body</span>&gt;
&lt;/<span style="color: #6c3163; font-weight: bold;">html</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-Apps" class="outline-2">
<h2 id="Apps"><span class="section-number-2">4</span> Apps</h2>
<div class="outline-text-2" id="text-Apps">
<p>
We may have multiple AngularJS apps for the same HTML file, and each app is
declared with the syntax <code class="src src-emacs-lisp">var app <span style="color: #6c3163; font-weight: bold;">=</span> angular.module(appName,dependencies)<span style="color: #2aa1ae; background-color: #ecf3ec;">;</span></code>.  One then furnishes each
<code class="src src-emacs-lisp">app</code> with its own controllers, filters,
directives, etc &#x2014;e.g., <code class="src src-js">app.filter(..., ...)</code>  as shown
above.
</p>
</div>
</div>
