index.html

<div id="outline-container-Directives" class="outline-2">
<h2 id="Directives"><span class="section-number-2">5</span> Directives &#x2014;Essentially “HTML Functions”</h2>
<div class="outline-text-2" id="text-Directives">
<p>
The HTML tags starting with <code class="src src-emacs-lisp">ng-</code> are AngularJS
<i>directives</i>. They operate on HTML elements; e.g., from the first section above,
the <code class="src src-emacs-lisp">ng-model</code> directive binds a name to the value
(text) of an HTML element (such an input box); whereas the
<code class="src src-emacs-lisp">ng-repeat</code> directive repeats an HTML element.
</p>

<ul class="org-ul">
<li>A page can be associated with multiple AngularJS apps, and
<code class="src src-emacs-lisp">ng-app</code> indicates where each app starts.</li>

<li><code class="src src-emacs-lisp">ng-init</code> defines variables and their
corresponding values (in the view itself), as shown above, &#x2014;but this is
usually done in a <i>controller</i> (later).</li>
</ul>

<p>
We can also define our own <a href="https://www.guru99.com/angularjs-custom-directive.html">custom directives</a>: Below, our custom
<code class="src src-emacs-lisp">ng-speak</code> directive injects a <code class="src src-html">&lt;<span style="color: #6c3163; font-weight: bold;">strong</span>&gt;</code> tag and prepends the text given to <code class="src src-emacs-lisp">ng-speak</code>.
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #6c3163; font-weight: bold;">html</span> <span style="color: #715ab1;">ng-app</span>=<span style="color: #2d9574;">"myApp"</span>&gt;
  &lt;<span style="color: #6c3163; font-weight: bold;">head</span>&gt;
    &lt;<span style="color: #6c3163; font-weight: bold;">script</span>
<span style="color: #715ab1;">src</span>=<span style="color: #2d9574;">"https://ajax.googleapis.com/ajax/libs/angularjs/1.8.2/angular.min.js"</span>&gt;
    &lt;/<span style="color: #6c3163; font-weight: bold;">script</span>&gt;
  &lt;/<span style="color: #6c3163; font-weight: bold;">head</span>&gt;
  &lt;<span style="color: #6c3163; font-weight: bold;">body</span>&gt;
    <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">This becomes:   &lt;strong&gt;</span><span style="color: #2aa1ae; background-color: #ecf3ec; font-weight: bold;"> Hello, my friends! </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;/strong&gt;  </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
    &lt;<span style="color: #6c3163; font-weight: bold;">div</span> ng-speak&gt; my friends &lt;/<span style="color: #6c3163; font-weight: bold;">div</span>&gt;
    <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">This becomes:  Sorted ... ["a","m","s","u"] </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
    &lt;<span style="color: #6c3163; font-weight: bold;">ng-woah</span>&gt;&lt;/<span style="color: #6c3163; font-weight: bold;">ng-woah</span>&gt;

    &lt;<span style="color: #6c3163; font-weight: bold;">script</span>&gt;
      var myApp = angular.module("myApp", [])

      myApp.directive('ngSpeak', function() {
           return {
             // Get the HTML within the directive call
             transclude: true,
             // Replace the div with this HTML template,
             // using the div contents.
             template: `&lt;<span style="color: #6c3163; font-weight: bold;">strong</span>&gt;
                          Hello, &lt;<span style="color: #6c3163; font-weight: bold;">ng-transclude</span>&gt;&lt;/<span style="color: #6c3163; font-weight: bold;">ng-transclude</span>&gt;!
                        &lt;/<span style="color: #6c3163; font-weight: bold;">strong</span>&gt;`
      }})

      myApp.directive('ngWoah', function() {
           return {
             template: `Sorted ... {{letters | orderBy: ''}}`,
             controller: function ($scope) {
                $scope.letters = "musa".split('') }
      }})
    &lt;/<span style="color: #6c3163; font-weight: bold;">script</span>&gt;
  &lt;/<span style="color: #6c3163; font-weight: bold;">body</span>&gt;
&lt;/<span style="color: #6c3163; font-weight: bold;">html</span>&gt;
</pre>
</div>

<p>
<b>AngularJS Custom Directives Naming:</b> The <i>definition</i> of directives uses <code>camelCase</code>
(as in <code class="src src-emacs-lisp">ngSpeak</code>), whereas the actual <i>use</i> of a
directive is done with <code>kebab-case</code> (as in <code class="src src-emacs-lisp">ng-speak</code>). Moreover, custom directive names must start with
<code class="src src-emacs-lisp">ng</code>.
</p>

<p>
Notice that there are two ways to use a directive: Both of <code class="src src-html">&lt;<span style="color: #6c3163; font-weight: bold;">div</span> ng-speak&gt; ... &lt;/<span style="color: #6c3163; font-weight: bold;">div</span>&gt;</code> and <code class="src src-html">&lt;<span style="color: #6c3163; font-weight: bold;">ng-speak</span>&gt; ... &lt;/<span style="color: #6c3163; font-weight: bold;">ng-speak</span>&gt;</code> tell AngularJS to instantiate a custom directive; i.e., to
expand its template which is managed by an instance of the specified controller.
</p>

<p>
The <code class="src src-emacs-lisp">template</code> may <code>{{evaluate}}</code> any data defined in
the parent scope; e.g., if our div occurs in the scope of a controller.
There are several attributes that can be used during a new directive creation;
here are a few:
</p>

<ul class="org-ul">
<li><code class="src src-emacs-lisp">template</code>: An inline string (HTML) template.</li>
<li><code class="src src-emacs-lisp">templateUrl</code>: An (longer) HTML template inside a
separate file.</li>
<li><code class="src src-emacs-lisp">transclude</code>: Place the child elements of
the directive as within the template.</li>
<li><p>
<code class="src src-emacs-lisp">controller</code>: Furnish the directive with bindings
from JS code.
</p>
<ul class="org-ul">
<li>We <i>attached the <code class="src src-emacs-lisp">letters</code> binding to the scope</i>
using AngularJS's “dependency injection”: We get the scope of the current tag
via the special ‘service’ <code class="src src-emacs-lisp">$scope</code>.</li>
<li>More on this below, in “MVC”.</li>
</ul>

<p>
Importantly, the <code class="src src-emacs-lisp">template</code> contains the
presentation logic and uses bindings, whereas the <code class="src src-emacs-lisp">controller</code> provides the <i>context</i> in which the bindings are evaluated.
</p></li>
</ul>

<p>
<i>Directives allow us to reuse functionality!</i> Similar parts of our HTML code are
abstracted out into <code class="src src-emacs-lisp">template</code>s and their bindings
(i.e., the pieces, values, in which the HTML parts differ) are abstracted out
into <code class="src src-emacs-lisp">controller</code>s.
</p>
<ul class="org-ul">
<li>We just invoke the directive to get the new feature.</li>
<li>This means that any alteration to the directive definition, such as the
template, propagates to all use sites; no copy-pasting needed.</li>
<li>The main view (index.html) becomes more declarative, cleaner.</li>
</ul>

<p>
<a href="https://docs.angularjs.org/tutorial/step_03">Components</a> are a <a href="https://docs.angularjs.org/guide/component">‘saner’</a> form of directives that aim to narrow scope.
</p>
</div>
</div>
