index.html

<div id="outline-container-MVC" class="outline-2">
<h2 id="MVC"><span class="section-number-2">6</span> The MVC Design Pattern &#x2014;Model, View, Controller</h2>
<div class="outline-text-2" id="text-MVC">
<p>
<b>Instead of declaring variables and their values <i>within</i> the view, we can do so
in a controller <i>for</i> the model.</b>
</p>

<p>
The <i>MVC</i> design pattern describes a separation of concerns by splitting an
application into 3 parts:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><i>Model</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">The application data, state: Variables and functions</td>
</tr>

<tr>
<td class="org-left"><i>View</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">The presentation of the data: HTML, templates, CSS</td>
</tr>

<tr>
<td class="org-left"><i>Controller</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">The brains/logic that connects the above two.</td>
</tr>
</tbody>
</table>

<p>
Tersely put, MVC is the CRUD operations &amp; state, the GUI, and the code to
connect the two &#x2014;e.g., changes in one are propagated to the other.
</p>

<p>
MVC splits a program into the (“backend, knowledge”) data, the (“frontend,
visual”) presentation, and the logic layers.  That is, <i>the view is a projection
of the model through the HTML template, as directed by the controller.</i>
</p>

<p>
E.g., in a restaurant, the kitchen with its ingredients and chefs is the model,
the menu and dinning table is the view, and the waiter is the controller.
</p>

<p>
<i>Two-way binding</i>: When we specify which control is associated to which part of a
view, AngularJS automatically keeps the two layers in sync.  As such, the
<i>controller</i> consumes user data from the view, uses model utilities to process the
data, then displays new data to the user via the view.
</p>

<p>
The special <code class="src src-emacs-lisp">$scope</code> ‘service’ is used to expose
the model to the view &#x2014;the controller's job is to populate the scope with
behaviour. That is, the view can execute any computation, and access any data,
that is bound to <code class="src src-emacs-lisp">$scope</code> &#x2014;as such, an app
generally has multiple controllers, each for a particular part of the view.
</p>
</div>
