index.html

<div id="outline-container-How-do-we-split-up-an-app" class="outline-3">
<h3 id="How-do-we-split-up-an-app"><span class="section-number-3">6.1</span> <i>How do we split up an app?</i></h3>
<div class="outline-text-3" id="text-How-do-we-split-up-an-app">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><i><b>How do we split up an app?</b></i></td>
</tr>
</tbody>
</table>

<p>
By way of example, the following code&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #3a81c3; font-weight: bold;">!doctype</span> html&gt;
&lt;<span style="color: #6c3163; font-weight: bold;">html</span> ng-app&gt;
  &lt;<span style="color: #6c3163; font-weight: bold;">head</span>&gt;
    &lt;<span style="color: #6c3163; font-weight: bold;">script</span>
<span style="color: #715ab1;">src</span>=<span style="color: #2d9574;">"https://ajax.googleapis.com/ajax/libs/angularjs/1.8.2/angular.min.js"</span>&gt;
    &lt;/<span style="color: #6c3163; font-weight: bold;">script</span>&gt;
  &lt;/<span style="color: #6c3163; font-weight: bold;">head</span>&gt;
  &lt;<span style="color: #6c3163; font-weight: bold;">body</span> <span style="color: #715ab1;">ng-init</span>=<span style="color: #2d9574;">"prompt = 'What is your name?'"</span>&gt;
    &lt;<span style="color: #6c3163; font-weight: bold;">input</span> type=text <span style="color: #715ab1;">ng-model</span>=<span style="color: #2d9574;">"userName"</span> <span style="color: #715ab1;">placeholder</span>=<span style="color: #2d9574;">"{{prompt}}"</span>&gt;
    &lt;<span style="color: #6c3163; font-weight: bold;">div</span> <span style="color: #715ab1;">ng-if</span>=<span style="color: #2d9574;">"userName"</span>&gt; "Why hello there, " {{userName}} &lt;/<span style="color: #6c3163; font-weight: bold;">div</span>&gt;
  &lt;/<span style="color: #6c3163; font-weight: bold;">body</span>&gt;
&lt;/<span style="color: #6c3163; font-weight: bold;">html</span>&gt;
</pre>
</div>

<p>
Can be split up using a <i>controller</i>&#x2026;
(We also change from <code>userName</code> to an object <code>user</code> with a field <code>name</code>)
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #3a81c3; font-weight: bold;">!doctype</span> html&gt;
&lt;<span style="color: #6c3163; font-weight: bold;">html</span> <span style="color: #715ab1;">ng-app</span>=<span style="color: #2d9574;">"myGreetingApp"</span>&gt; <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">NEW </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
  &lt;<span style="color: #6c3163; font-weight: bold;">head</span>&gt;
    &lt;<span style="color: #6c3163; font-weight: bold;">script</span>
<span style="color: #715ab1;">src</span>=<span style="color: #2d9574;">"https://ajax.googleapis.com/ajax/libs/angularjs/1.8.2/angular.min.js"</span>&gt;
    &lt;/<span style="color: #6c3163; font-weight: bold;">script</span>&gt;
  &lt;/<span style="color: #6c3163; font-weight: bold;">head</span>&gt;
  &lt;<span style="color: #6c3163; font-weight: bold;">body</span> <span style="color: #715ab1;">ng-controller</span>=<span style="color: #2d9574;">"PromptController"</span>&gt; <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">NEW </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
    &lt;<span style="color: #6c3163; font-weight: bold;">input</span> type=text <span style="color: #715ab1;">ng-model</span>=<span style="color: #2d9574;">"user.name"</span> <span style="color: #715ab1;">placeholder</span>=<span style="color: #2d9574;">"{{prompt}}"</span>&gt;
    &lt;<span style="color: #6c3163; font-weight: bold;">div</span> <span style="color: #715ab1;">ng-if</span>=<span style="color: #2d9574;">"user.name"</span>&gt; {{greet(user)}} &lt;/<span style="color: #6c3163; font-weight: bold;">div</span>&gt;
    &lt;<span style="color: #6c3163; font-weight: bold;">script</span>&gt; // NEW
      angular.module("myGreetingApp", [])
       .controller("PromptController",
         function($scope){
           // One-time setup for prompt
           $scope.prompt = "What is your name?"
           // Whenever the user changes, this function <span style="text-decoration: underline;">is called</span>.
           $scope.greet = function(user){
             return  "Why hello there, " + user.name
      }})
    &lt;/<span style="color: #6c3163; font-weight: bold;">script</span>&gt;
  &lt;/<span style="color: #6c3163; font-weight: bold;">body</span>&gt;
&lt;/<span style="color: #6c3163; font-weight: bold;">html</span>&gt;
</pre>
</div>

<p>
( The line <code class="src src-html">&lt;<span style="color: #6c3163; font-weight: bold;">body</span> <span style="color: #715ab1;">ng-controller</span>=<span style="color: #2d9574;">"PromptController"</span>&gt;</code> lets
everything in the <code class="src src-emacs-lisp">body</code> tag have access to the
functionality of the <code class="src src-emacs-lisp">PromptController</code> (which is
just a JS function).  Notice that our controller <i>defines</i> <code class="src src-emacs-lisp">prompt</code> and <code class="src src-emacs-lisp">greet</code> for use in the view
---<i>using</i> the value of the input box, which is declared in the view with
<code class="src src-emacs-lisp">ng-model=<span style="color: #2d9574;">"user.name"</span></code>; conversely, we can update
the <code>user.name</code> <i>input box</i>'s value using the controller: <code>$scope.user.name =
"hola"</code>. )
</p>

<p>
The above is a bit messy, and so we split it up further into two files: The
<code class="src src-emacs-lisp">mvc_frontend.html</code> file focus on presentation only&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #3a81c3; font-weight: bold;">!doctype</span> html&gt;
&lt;<span style="color: #6c3163; font-weight: bold;">html</span> <span style="color: #715ab1;">ng-app</span>=<span style="color: #2d9574;">"myGreetingApp"</span>&gt;
  &lt;<span style="color: #6c3163; font-weight: bold;">head</span>&gt;
    &lt;<span style="color: #6c3163; font-weight: bold;">script</span>
<span style="color: #715ab1;">src</span>=<span style="color: #2d9574;">"https://ajax.googleapis.com/ajax/libs/angularjs/1.8.2/angular.min.js"</span>&gt;
    &lt;/<span style="color: #6c3163; font-weight: bold;">script</span>&gt;
    &lt;<span style="color: #6c3163; font-weight: bold;">script</span> <span style="color: #715ab1;">src</span>=<span style="color: #2d9574;">"mvc_backend.js"</span>&gt;&lt;/<span style="color: #6c3163; font-weight: bold;">script</span>&gt; <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">NEW </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
  &lt;/<span style="color: #6c3163; font-weight: bold;">head</span>&gt;
  &lt;<span style="color: #6c3163; font-weight: bold;">body</span> <span style="color: #715ab1;">ng-controller</span>=<span style="color: #2d9574;">"PromptController"</span>&gt;
    &lt;<span style="color: #6c3163; font-weight: bold;">input</span> type=text <span style="color: #715ab1;">ng-model</span>=<span style="color: #2d9574;">"user.name"</span> <span style="color: #715ab1;">placeholder</span>=<span style="color: #2d9574;">"{{prompt}}"</span>&gt;
    &lt;<span style="color: #6c3163; font-weight: bold;">div</span> <span style="color: #715ab1;">ng-if</span>=<span style="color: #2d9574;">"user.name"</span>&gt; {{greet(user)}} &lt;/<span style="color: #6c3163; font-weight: bold;">div</span>&gt;
  &lt;/<span style="color: #6c3163; font-weight: bold;">body</span>&gt;
&lt;/<span style="color: #6c3163; font-weight: bold;">html</span>&gt;
</pre>
</div>
<p>
&#x2026;and the <code class="src src-emacs-lisp">mvc_backend.js</code> file, which has the bindings,&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Model</span>
<span style="color: #3a81c3; font-weight: bold;">var</span> <span style="color: #715ab1;">app</span> = angular.module(<span style="color: #2d9574;">"myGreetingApp"</span>, [])
<span style="color: #3a81c3; font-weight: bold;">function</span> <span style="color: #6c3163; font-weight: bold;">greet</span>(<span style="color: #715ab1;">user</span>) { <span style="color: #3a81c3; font-weight: bold;">return</span>  <span style="color: #2d9574;">"Why hello there, "</span> + user.name }

<span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Controllers</span>
app.controller(<span style="color: #2d9574;">"PromptController"</span>,
      <span style="color: #3a81c3; font-weight: bold;">function</span>(<span style="color: #715ab1;">$scope</span>){
        $scope.prompt = <span style="color: #2d9574;">"What is your name?"</span>
        $scope.greet  = greet
     })
</pre>
</div>

<p>
It may be useful to know that within a controller, <code class="src src-emacs-lisp">$eval</code> acts like <code>{{...}}</code>; e.g., instead of <code class="src src-emacs-lisp">$scope.a <span style="color: #6c3163; font-weight: bold;">+</span> $scope.b</code> we may write <code class="src src-emacs-lisp">$scope.$eval('a <span style="color: #6c3163; font-weight: bold;">+</span> b')</code>.
</p>
</div>
</div>
