index.html

<div id="outline-container-Number-Guessing-Game" class="outline-3">
<h3 id="Number-Guessing-Game"><span class="section-number-3">6.2</span> Number Guessing Game</h3>
<div class="outline-text-3" id="text-Number-Guessing-Game">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b><i>Number Guessing Game</i></b></td>
</tr>
</tbody>
</table>

<p>
Exercise: Using <code class="src src-emacs-lisp">ng-init</code>, <code class="src src-emacs-lisp">ng-click</code>, controllers, and other directives, build a “number guessing game”; the user
makes a guess in an input box, sees whether the guess is too high or low or
correct, and has a “new game” button.
Finally, give the user an “I give up” button which shows the answer
&#x2014;hint, use <code class="src src-emacs-lisp">ng-if</code>.
</p>

<p>
Hint: This can be done in under 40 lines, in a single file.
</p>
</div>
</div>
</div>

<div id="outline-container-Single-Page-Applications-SPA-and-src-emacs-lisp-exports-code-route" class="outline-2">
<h2 id="Single-Page-Applications-SPA-and-src-emacs-lisp-exports-code-route"><span class="section-number-2">7</span> Single Page Applications (SPA) and <code class="src src-emacs-lisp">$route</code></h2>
<div class="outline-text-2" id="text-Single-Page-Applications-SPA-and-src-emacs-lisp-exports-code-route">
<p>
SPA's give the feeling that the entire application is in a single webpage: When
the user requests something, <i>part of the webpage</i> changes rather than loading an
entirely new webpage. Example SPA's include Gmail and Netflix.
</p>

<p>
That is, instead of having a webpage for each aspect of your app, we have a
single webpage and <i>multiple</i> views &#x2014;one of which is shown to the user depending
on what they want&#x2014; each with its own controller (since each view has its own
goals).
</p>

<p>
SPA's can be created as follows &#x2014;and exemplified in the code below.
</p>

<ol class="org-ol">
<li><p>
Add <code class="src src-emacs-lisp">angular-route</code> as a script reference <i>after</i>
the AngularJS script.
</p>

<p>
Routing is used to present different views to the user on the same web page:
The <code class="src src-emacs-lisp">$route</code> service watches the URL, and
whenever it changes, a route definition is looked up (i.e., view +
controller).
</p>

<p>
<code class="src src-js"><span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[1b]</span></code> In the app declaration (the JS file), we need
to add a dependency on the <code class="src src-emacs-lisp">ngRoute</code> module.
</p></li>

<li>Add <code class="src src-emacs-lisp">href</code> tags which will represent links to
the different parts of the application.</li>

<li><p>
Add the <code class="src src-emacs-lisp">ng-view</code> directive within the
application; it's used to inject the various views.
</p>

<p>
Whenever the route (the URL in your browser's address bar) changes, we load
the associated HTML template view at the location of the
<code class="src src-emacs-lisp">ng-view</code> directive.
</p></li>

<li><p>
Define routes through <code class="src src-emacs-lisp">$routeProvider</code>.
</p>

<p>
<code class="src src-js"><span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[4a]</span></code> Whenever the user clicks on the href tag <code>home</code>,
from step 2, we place the HTML <code class="src src-html">About &lt;<span style="color: #6c3163; font-weight: bold;">em</span>&gt;<span style="font-style: italic;">Us</span>&lt;/<span style="color: #6c3163; font-weight: bold;">em</span>&gt;</code>
into the place of the <code class="src src-emacs-lisp">ng-view</code> tag.
</p>

<p>
<code class="src src-js"><span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[4b]</span></code> Whenever the user clicks on the href tag <code>"hello"</code>,
from step 2, we place the contents of <code>hello.html</code> into the place of the
<code class="src src-emacs-lisp">ng-view</code> tag.
</p>

<p>
<code class="src src-js"><span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[4c]</span></code> Whenever the user clicks on the href tag
<code>newevent</code>, the <code>newevent.html</code> template is inserted in-place of the
<code class="src src-emacs-lisp">ng-view</code> tag <i>and</i> this view is given the
<code class="src src-emacs-lisp">NewEventController</code> controller to manage its
state and logic.
</p>

<p>
<code class="src src-js"><span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[4d]</span></code> This route definition has a custom key-value
pair defined in the route, which is then accessed in step 5 from the
<code class="src src-emacs-lisp">$route</code> service and attached to the
<code class="src src-emacs-lisp">$scope</code> for use in the template.
</p>

<p>
<code class="src src-js"><span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[4e]</span></code> Parameters can be passed to the route via the
URL; e.g., <code>index.html#!/go/1</code> and <code>index.html#!/go/23</code> are two routes with the
parameter being 1 and 23.  The controller service <code class="src src-emacs-lisp">$routeParams</code> then access the parameters.  (Note: <code>index.html#!/go/</code> is
the route <code>go</code> with an empty parameter; it is different from <code>index.html#!/go</code>,
which has no parameters and so is either supported in its own route
definition or redirects to the default route.)
</p>

<p>
<code class="src src-js"><span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[4f]</span></code> Whenever the URL has a route not accounted for
&#x2014;such as when the page opens up, or the user changes the URL to
gibberish&#x2014;, then we redirect them to a default route.  When not provided,
unconsidered routes redirect to the landing page; i.e., <code class="src src-js">redirectTo: <span style="color: #2d9574;">'/'</span></code>.
</p></li>

<li><p>
Add controllers to the application.
</p>

<p>
Just as the controller <code class="src src-emacs-lisp">$scope</code> service passes
information from the model to the view , the <code class="src src-emacs-lisp">$route</code> service accesses properties of the route.
</p>

<p>
Note that we could reuse the controller among multiple views, or, more
likely, each view could have its own controller.
</p></li>

<li><p>
Create the different web pages for the application
</p>

<p>
In our example below, we use the following templates:
</p></li>
</ol>

<div style="column-rule-style: none;column-count: 2;">
<p>
<span class="underline">hello.html</span>
</p>
<div class="org-src-container">
<pre class="src src-html">Hello!
</pre>
</div>
<p>
<p><br>
<span class="underline">newevent.html</span>
</p>
<div class="org-src-container">
<pre class="src src-html">Wanna add a new event, eh?
{{message}}
</pre>
</div>

</div>

<p>
. . . . . . . . . . . . . . . . . . . . . . .
<code class="src src-emacs-lisp">index.html</code>
. . . . . . . . . . . . . . . . . . . . . . .
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #6c3163; font-weight: bold;">html</span> ng-app = <span style="color: #2d9574;">"myApp"</span>&gt;
  &lt;<span style="color: #6c3163; font-weight: bold;">head</span>&gt;
    &lt;<span style="color: #6c3163; font-weight: bold;">script</span>
<span style="color: #715ab1;">src</span>=<span style="color: #2d9574;">"https://ajax.googleapis.com/ajax/libs/angularjs/1.8.2/angular.min.js"</span>&gt;
    &lt;/<span style="color: #6c3163; font-weight: bold;">script</span>&gt;
    &lt;<span style="color: #6c3163; font-weight: bold;">script</span>
