index.html
<span style="color: #715ab1;">src</span>=<span style="color: #2d9574;">"https://ajax.googleapis.com/ajax/libs/angularjs/1.8.2/angular-route.min.js"</span>&gt;
    &lt;/<span style="color: #6c3163; font-weight: bold;">script</span>&gt;  <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[1] </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
    &lt;<span style="color: #6c3163; font-weight: bold;">script</span> <span style="color: #715ab1;">src</span>=<span style="color: #2d9574;">"script.js"</span>&gt;&lt;/<span style="color: #6c3163; font-weight: bold;">script</span>&gt;
  &lt;/<span style="color: #6c3163; font-weight: bold;">head</span>&gt;
  &lt;<span style="color: #6c3163; font-weight: bold;">body</span>&gt;
    This text appears alongside every view &lt;<span style="color: #6c3163; font-weight: bold;">hr</span>&gt;
    <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[2] </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
    &lt;<span style="color: #6c3163; font-weight: bold;">a</span> <span style="color: #715ab1;">href</span>=<span style="color: #2d9574;">"#!/hello"</span>&gt;Hello&lt;/<span style="color: #6c3163; font-weight: bold;">a</span>&gt;&lt;<span style="color: #6c3163; font-weight: bold;">br</span>&gt;
    &lt;<span style="color: #6c3163; font-weight: bold;">a</span> <span style="color: #715ab1;">href</span>=<span style="color: #2d9574;">"#!/home"</span>&gt;Home&lt;/<span style="color: #6c3163; font-weight: bold;">a</span>&gt;&lt;<span style="color: #6c3163; font-weight: bold;">br</span>&gt;
    &lt;<span style="color: #6c3163; font-weight: bold;">a</span> <span style="color: #715ab1;">href</span>=<span style="color: #2d9574;">"#!/newevent"</span>&gt;Add new event&lt;/<span style="color: #6c3163; font-weight: bold;">a</span>&gt;&lt;<span style="color: #6c3163; font-weight: bold;">br</span>&gt;
    &lt;<span style="color: #6c3163; font-weight: bold;">a</span> <span style="color: #715ab1;">href</span>=<span style="color: #2d9574;">"#!/greet"</span>&gt;Welcome&lt;/<span style="color: #6c3163; font-weight: bold;">a</span>&gt;&lt;<span style="color: #6c3163; font-weight: bold;">br</span>&gt;
    &lt;<span style="color: #6c3163; font-weight: bold;">input</span> <span style="color: #715ab1;">type</span>=<span style="color: #2d9574;">"number"</span> <span style="color: #715ab1;">ng-model</span>=<span style="color: #2d9574;">"it"</span> <span style="color: #715ab1;">placeholder</span>=<span style="color: #2d9574;">"0"</span>&gt;
    &lt;<span style="color: #6c3163; font-weight: bold;">a</span> <span style="color: #715ab1;">ng-href</span>=<span style="color: #2d9574;">"#!/go/{{it}}"</span>&gt;Go!&lt;/<span style="color: #6c3163; font-weight: bold;">a</span>&gt;
    <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[3] </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
    &lt;<span style="color: #6c3163; font-weight: bold;">br</span>&gt;&lt;<span style="color: #6c3163; font-weight: bold;">div</span> ng-view&gt;&lt;/<span style="color: #6c3163; font-weight: bold;">div</span>&gt;&lt;<span style="color: #6c3163; font-weight: bold;">hr</span>&gt;
    Likewise, this text appears alongside every view
  &lt;/<span style="color: #6c3163; font-weight: bold;">body</span>&gt;
&lt;/<span style="color: #6c3163; font-weight: bold;">html</span>&gt;
</pre>
</div>

<p>
. . . . . . . . . . . . . . . . . . . . . . .
<code class="src src-emacs-lisp">script.js</code>
. . . . . . . . . . . . . . . . . . . . . . .
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">var</span> <span style="color: #715ab1;">myApp</span> = angular
            .module(<span style="color: #2d9574;">"myApp"</span>,[<span style="color: #2d9574;">"ngRoute"</span>]) <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[1b]</span>

myApp.config(<span style="color: #3a81c3; font-weight: bold;">function</span>(<span style="color: #715ab1;">$routeProvider</span>){ <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[4]</span>
    $routeProvider
        <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[4a] Inline HTML template</span>
        .when(<span style="color: #2d9574;">"/home"</span>,{
            template:<span style="color: #2d9574;">"About &lt;em&gt;Us&lt;/em&gt;"</span>
        })
        <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[4b] HTML template in another file</span>
        .when(<span style="color: #2d9574;">"/hello"</span>, {
            templateUrl: <span style="color: #2d9574;">"hello.html"</span>
        })
        <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[4c] HTML template that has {{expressions}}</span>
        .when(<span style="color: #2d9574;">"/newevent"</span>, {
            templateUrl: <span style="color: #2d9574;">"newevent.html"</span>,
            controller: <span style="color: #2d9574;">'NewEventController'</span>
        })
        <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[4d] HTML /inline/ template that has {{expressions}}</span>
        <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">and has a key-value pair declared in the route definition.</span>
        .when(<span style="color: #2d9574;">"/greet"</span>, {
            myfriend: <span style="color: #2d9574;">"Jasim"</span>,
            template: <span style="color: #2d9574;">"Hello, {{person}}!"</span>,
            controller: <span style="color: #2d9574;">'GreetingController'</span>
        })
         <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[4e] A template with a parameter &#8220;myParam&#8221;;</span>
         <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">which the controller decides to bind it to &#8220;page&#8221;.</span>
        .when(<span style="color: #2d9574;">"/go/:myParam"</span>, {
            template: <span style="color: #2d9574;">"Welcome to page: {{page}}"</span>,
            controller: <span style="color: #2d9574;">'GoController'</span>
        })
        <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[4f] When gibberish is appended to the URL, go to &#8220;/hello&#8221;</span>
        .otherwise({
            redirectTo: <span style="color: #2d9574;">'/hello'</span>
        })})
<span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[5]</span>
myApp.controller(<span style="color: #2d9574;">'NewEventController'</span>, <span style="color: #3a81c3; font-weight: bold;">function</span>(<span style="color: #715ab1;">$scope</span>){  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[4c]</span>
    $scope.message = <span style="color: #2d9574;">"Hola!"</span> })
myApp.controller(<span style="color: #2d9574;">'GreetingController'</span>, <span style="color: #3a81c3; font-weight: bold;">function</span>(<span style="color: #715ab1;">$scope</span>, <span style="color: #715ab1;">$route</span>){ <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[4d]</span>
    $scope.person = $route.current.myfriend })
myApp.controller(<span style="color: #2d9574;">'GoController'</span>, <span style="color: #3a81c3; font-weight: bold;">function</span>(<span style="color: #715ab1;">$scope</span>, <span style="color: #715ab1;">$routeParams</span>){ <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[4e]</span>
    $scope.page = $routeParams.myParam })
</pre>
</div>

<p>
<a href="https://stackoverflow.com/questions/16251420/couldnt-load-template-using-templateurl-in-angularjs/16251614#16251614"><i>Things may not work!</i></a> Open up the console in your browser &#x2014;F12&#x2014; and you may
see an <a href="https://developer.mozilla.org/pl/docs/XMLHttpRequest">XMLHttpRequest</a> (XHR) error; XHR requests is how AngularJS loads templates
via an HTTP server.  One solution is to run your own <a href="https://stackoverflow.com/questions/16333790/node-js-quick-file-server-static-files-over-http/16350826#16350826">web server</a>:
</p>
<ol class="org-ol">
<li><code>npm install http-server -g</code></li>
<li><code>cd ⟨my-folder⟩</code></li>
<li><code>http-server</code></li>
<li>Then open <a href="http://localhost:8080/index.html">http://localhost:8080/index.html</a></li>
</ol>
</div>
</div>
<div id="outline-container-Reads" class="outline-2">
<h2 id="Reads"><span class="section-number-2">8</span> Reads</h2>
<div class="outline-text-2" id="text-Reads">
<p>
The first two links below each contain lots of small, digestible, tutorials on
AngularJS with numerous screenshots.
</p>

<ul class="org-ul">
<li><a href="https://www.guru99.com/angularjs-tutorial.html">guru99.com ;; AngularJS Tutorial for Beginners: Learn AngularJS Step by Step</a></li>

<li><a href="https://www.wikitechy.com/angularjs/my-first-application-in-angularjs">wikitechy.com ;; My First Application In AngularJS</a></li>

<li><a href="https://www.w3schools.com/angular/">w3schools ;; AngularJS Tutorial</a></li>

<li><a href="https://www.youtube.com/watch?v=TRrL5j3MIvo">Youtube ;; Introduction to Angular.js in 50 Examples</a></li>

<li><a href="https://www.freecodecamp.org/news/simplified-explanation-to-mvc-5d307796df30/">What is MVC, and how is it like a sandwich shop?</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: <a href="https://alhassy.github.io/">Musa Al-hassy</a></p>
<p class="date">Created: 2021-02-28 Sun 07:45</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
